testCase/reactingJet/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    (-4.00000 -2.00000 -2.00000) //0
    (0.00000 -2.00000 -2.00000) //1
    (0.00000 2.00000 -2.00000) //2
    (-4.00000 2.00000 -2.00000) //3
    (-4.00000 -2.00000 2.00000) //4
    (0.00000 -2.00000 2.00000) //5
    (0.00000 2.00000 2.00000) //6
    (-4.00000 2.00000 2.00000) //7
    (80.00000 2.00000 2.00000) //8
    (80.00000 20.00000 2.00000) //9
    (0.00000 20.00000 2.00000) //10
    (0.00000 2.00000 20.00000) //11
    (80.00000 2.00000 20.00000) //12
    (80.00000 20.00000 20.00000) //13
    (0.00000 20.00000 20.00000) //14
    (80.00000 -2.00000 2.00000) //15
    (0.00000 -2.00000 20.00000) //16
    (80.00000 -2.00000 20.00000) //17
    (0.00000 -20.00000 2.00000) //18
    (80.00000 -20.00000 2.00000) //19
    (0.00000 -20.00000 20.00000) //20
    (80.00000 -20.00000 20.00000) //21
    (80.00000 2.00000 -2.00000) //22
    (80.00000 20.00000 -2.00000) //23
    (0.00000 20.00000 -2.00000) //24
    (80.00000 -2.00000 -2.00000) //25
    (0.00000 -20.00000 -2.00000) //26
    (80.00000 -20.00000 -2.00000) //27
    (0.00000 2.00000 -20.00000) //28
    (80.00000 2.00000 -20.00000) //29
    (80.00000 20.00000 -20.00000) //30
    (0.00000 20.00000 -20.00000) //31
    (0.00000 -2.00000 -20.00000) //32
    (80.00000 -2.00000 -20.00000) //33
    (0.00000 -20.00000 -20.00000) //34
    (80.00000 -20.00000 -20.00000) //35
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (6 6 6) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (6 8 9 10 11 12 13 14) (120 27 27) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (5 15 8 6 16 17 12 11) (120 6 27) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (18 19 15 5 20 21 17 16) (120 27 27) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (2 22 23 24 6 8 9 10) (120 27 6) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (1 25 22 2 5 15 8 6) (120 6 6) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (26 27 25 1 18 19 15 5) (120 27 6) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (28 29 30 31 2 22 23 24) (120 27 27) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (32 33 29 28 1 25 22 2) (120 6 27) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
    hex (34 35 33 32 26 27 25 1) (120 27 27) edgeGrading (1 1 1 1 1 1 1 1 1 1 1 1)
);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (2 1 0 3) //0
            (4 5 6 7) //1
            (7 6 2 3) //2
            (5 4 0 1) //3
        );
    }

    fuel
    {
        type patch;
        faces
        (
            (4 7 3 0) //0
        );
    }

    air
    {
        type patch;
        faces
        (
            (11 12 13 14) //0
            (13 12 8 9) //1
            (14 13 9 10) //2
            (11 14 10 6) //3
            (16 17 12 11) //4
            (12 17 15 8) //5
            (16 11 6 5) //6
            (20 21 17 16) //7
            (17 21 19 15) //8
            (20 16 5 18) //9
            (21 20 18 19) //10
            (9 8 22 23) //11
            (10 9 23 24) //12
            (6 10 24 2) //13
            (8 15 25 22) //14
            (15 19 27 25) //15
            (18 5 1 26) //16
            (19 18 26 27) //17
            (30 29 28 31) //18
            (23 22 29 30) //19
            (24 23 30 31) //20
            (2 24 31 28) //21
            (29 33 32 28) //22
            (22 25 33 29) //23
            (1 2 28 32) //24
            (33 35 34 32) //25
            (25 27 35 33) //26
            (26 1 32 34) //27
            (27 26 34 35) //28
        );
    }

);
mergePatchPairs
(
);

// ************************************************************************* //